app/controllers/application_controller.rb

    def find_all_sections
      @all_sections = Section.all
---
SELECT * FROM "sections"