app/controllers/department_controller.rb

  def index
		@departments = Department.all
---
SELECT * FROM "departments"