app/controllers/logins_controller.rb

INSERT INTO "logins" ("created_at", "updated_at", "username", "level", "password") VALUES('2009-09-17 15:19:14', '2009-09-17 15:19:14', NULL, NULL, NULL)
---
  def create
    @new_user = Login.new(params[:login])
    if (@new_user.save)

SELECT * FROM "logins" WHERE ("logins"."username" = 'James' AND "logins"."password" = 'wcmc') LIMIT 1
---
  def do_login
    username = params[:user][:username]
    password = params[:user][:password]

    if (username.nil? || password.nil?)
      flash[:notice] = 'Unknown user or invalid password'
      redirect_to :action => 'login'

    else
      login = Login.find(:first, :conditions => { :username => username, :password => password })