app/controllers/sections_controller.rb

SELECT * FROM "sections"
---
  def index
    if (authorize(true))
      @sections = Section.all

SELECT * FROM "sections" WHERE ("sections"."id" = 1)
---
  def show
    @section = Section.find(params[:id])

SELECT * FROM "sections" WHERE ("sections"."id" = 1)
---
  def edit
    @section = Section.find(params[:id])

INSERT INTO "sections" ("name", "created_at", "updated_at") VALUES('About', '2009-09-11 12:51:49', '2009-09-11 12:51:49')
---
  def create

    @section = Section.new(params[:section])

    respond_to do |format|
      if @section.save