app/controllers/subsections_controller.rb

  def show
    @logged_in = logged_in?
    @subsection = @section.subsections.find(params[:id])
    @section_subsections = @section.subsections.all
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)
SELECT * FROM "subsections" WHERE ("subsections"."id" = 1 AND ("subsections".section_id = 1))
SELECT * FROM "sections"

  def create
    @subsection = @section.subsections.build(params[:subsection])

    if @subsection.save
---
INSERT INTO "subsections" ("name", "created_at", "section_id", "updated_at", "content") VALUES('Content Section', '2009-09-21 15:44:00', 2, '2009-09-21 15:44:00', 'This section is actually getting some content! La la la content content super win content <b>yay</b>')

  def edit
    @subsection = @section.subsections.find(params[:id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)
SELECT * FROM "subsections" WHERE ("subsections"."id" = 1 AND ("subsections".section_id = 1))

  def update
    @subsection = Subsection.find(params[:id])

    respond_to do |format|
      if @subsection.update_attributes(params[:subsection])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)
SELECT * FROM "subsections" WHERE ("subsections"."id" = 1)
UPDATE "subsections" SET "updated_at" = '2009-09-22 09:17:06', "content" = '<table border="0" cellspacing="0" cellpadding="0">

    def find_section
      @section = Section.find(params[:section_id])
---
SELECT * FROM "sections" WHERE ("sections"."id" = 1)